package com.rsschool.quiz

class DataBase {
    companion object {
        val questionsList: Map<Int, String> = mapOf(
            1 to "Какая страна присоединилась к ЕС в 2007 году?",
            2 to "Что вещий Олег предлагал в награду вдохновленному кудеснику?",
            3 to "Какие птицы существуют?",
            4 to "Как звали доблестного рыцаря Айвенго?",
            5 to "Какая горная система самая протяженная на Земле?"
        )

        val rightAnswersList: Map<Int, String> = mapOf(
            1 to "1",
            2 to "3",
            3 to "4",
            4 to "1",
            5 to "2"
        )

        val answersList: Map<Int, List<String>> = mapOf(
            1 to listOf("Болгария", "Словакия", "Чехия", "Кипр", "Украина"),
            2 to listOf("Гробовую змею", "Злато", "Коня", "Серебро", "Меч"),
            3 to listOf("Пошевни", "Таратайки", "Пролетки", "Фаэтоны", "Маэтоны"),
            4 to listOf("Уилфред", "Реджинальд", "Ланселот", "Джон", "Иван"),
            5 to listOf("Альпы", "Анды", "Аппалачи", "Гималаи", "Восточные Судеты")
        )
    }
}